:PROPERTIES:
:ID:       940545e6-a194-4e91-ad96-70a3965ceb7c
:END:
#+TITLE: Python: Setting up Emacs-Jupyter with Poetry
#+CATEGORY: slips
#+TAGS:

**** First Attempt

So now, =which jupyter= gives:

#+begin_quote
/my/.pyenv/versions/3.10.11/envs/poet-ipykernel-3.10.11/bin/jupyter
#+end_quote

But more critically ... =emacs-jupyter= still doesn't include the jupyter we
want :(

#+begin_src emacs-lisp
;; the second arg is "refresh"
(jupyter-available-kernelspecs t)
#+end_src

#+RESULTS2:
| nurbs-ipykernel | /home/me/.local/share/jupyter/kernels/nurbs-ipykernel            | :argv | [/my/.pyenv/versions/3.10.11/envs/nurbs-ipykernel-3.10.11/bin/python -m ipykernel_launcher -f {connection_file}] | :env | nil | :display_name | nurbs-ipykernel      | :language | python | :interrupt_mode | signal | :metadata | (:debugger t) |
| poet-ipykernel  | /home/me/.local/share/jupyter/kernels/poet-ipykernel             | :argv | [/my/.pyenv/versions/3.10.11/envs/poet-ipykernel-3.10.11/bin/python -m ipykernel_launcher -f {connection_file}] | :env | nil | :display_name | poet-ipykernel       | :language | python | :interrupt_mode | signal | :metadata | (:debugger t) |
| python3         | /my/.pyenv/versions/3.10.11/share/jupyter/kernels/python3 | :argv | [python -m ipykernel_launcher -f {connection_file}]                                       | :env | nil | :display_name | Python 3 (ipykernel) | :language | python | :interrupt_mode | signal | :metadata | (:debugger t) |

It runs this command, but not within the =.envrc= profile as expected

#+begin_src sh
jupyter kernelspec list --json | jq '.kernelspecs[].resource_dir'
#+end_src

#+RESULTS:
| /my/python/nb/poet/.venv/share/jupyter/kernels/python3 |
| /home/me/.local/share/jupyter/kernels/poet-ipykernel          |
| /home/me/.local/share/jupyter/kernels/nurbs-ipykernel         |

Opening the project directory in a new instance of emacs works fine.

It appears that something has cached in emacs that isn't cleared by =envrc.el=
when all the buffers/files are cleared. It seems important to ensure the
pyenv/poetry environments are set up before opening the project in emacs.

**** After Restart

Now, =which jupyter= gives: =/my/python/nb/poet/.venv/bin/jupyter=

So direnv is definitely being loaded properly. However,
=(jupyter-available-kernelspecs t)= still doesn't report the proper
kernelspec.

+ So =(jupyter-command ...)=
+ calls =(process-file ..)= with some setup
+ which itself basically wraps =(call-process ...)= with some setup.

However, the following gives the expected results:

#+begin_src emacs-lisp
(call-process "jupyter" nil t t "kernelspec" "list" )
#+end_src

#+RESULTS:
: 0

Though it inserts its results in =current-buffer= without specifying:

#+begin_quote
Available kernels:
  python3            /my/python/nb/poet/.venv/share/jupyter/kernels/python3
  nurbs-ipykernel    /home/me/.local/share/jupyter/kernels/nurbs-ipykernel
  poet-ipykernel     /home/me/.local/share/jupyter/kernels/poet-ipykernel
#+end_quote

The issue is that, the call to =jupyter-command= has
=/my/python/nb/.venv/bin= as the first entry in =exec-path=. Then the
call to =process-file= has a completely different =exec-path=

#+begin_src emacs-lisp
(jupyter-command "--paths")
#+end_src

#+RESULTS:
#+begin_example
config:
    /home/me/.jupyter
    /home/me/.local/etc/jupyter
    /my/.pyenv/versions/3.10.11/etc/jupyter
    /usr/local/etc/jupyter
    /etc/jupyter
data:
    /home/me/.local/share/jupyter
    /my/.pyenv/versions/3.10.11/share/jupyter
    /usr/local/share/jupyter
    /usr/share/jupyter
runtime:
    /home/me/.local/share/jupyter/runtime
#+end_example

